{"class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "embedding_2_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "float32", "sparse": false, "name": "embedding_2_input"}, "inbound_nodes": []}, {"name": "embedding_last_name_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "float32", "sparse": false, "name": "embedding_last_name_input"}, "inbound_nodes": []}, {"name": "embedding_first_name", "class_name": "Embedding", "config": {"name": "embedding_first_name", "trainable": true, "batch_input_shape": [null, 50], "dtype": "float32", "input_dim": 726, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 50}, "inbound_nodes": [[["embedding_2_input", 0, 0, {}]]]}, {"name": "embedding_last_name", "class_name": "Embedding", "config": {"name": "embedding_last_name", "trainable": true, "batch_input_shape": [null, 50], "dtype": "float32", "input_dim": 726, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 50}, "inbound_nodes": [[["embedding_last_name_input", 0, 0, {}]]]}, {"name": "bidirectional_first_name", "class_name": "Bidirectional", "config": {"name": "bidirectional_first_name", "trainable": true, "batch_input_shape": [null, 50, 1], "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}}, "merge_mode": "concat"}, "inbound_nodes": [[["embedding_first_name", 0, 0, {}]]]}, {"name": "bidirectional_last_name", "class_name": "Bidirectional", "config": {"name": "bidirectional_last_name", "trainable": true, "batch_input_shape": [null, 50, 1], "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}}, "merge_mode": "concat"}, "inbound_nodes": [[["embedding_last_name", 0, 0, {}]]]}, {"name": "hidden_first_name_1", "class_name": "Dense", "config": {"name": "hidden_first_name_1", "trainable": true, "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["bidirectional_first_name", 0, 0, {}]]]}, {"name": "hidden_last_name_1", "class_name": "Dense", "config": {"name": "hidden_last_name_1", "trainable": true, "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["bidirectional_last_name", 0, 0, {}]]]}, {"name": "hidden_first_name_2", "class_name": "Dense", "config": {"name": "hidden_first_name_2", "trainable": true, "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_first_name_1", 0, 0, {}]]]}, {"name": "hidden_last_name_2", "class_name": "Dense", "config": {"name": "hidden_last_name_2", "trainable": true, "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_last_name_1", 0, 0, {}]]]}, {"name": "first_name_output", "class_name": "Dense", "config": {"name": "first_name_output", "trainable": true, "units": 26, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_first_name_2", 0, 0, {}]]]}, {"name": "last_name_output", "class_name": "Dense", "config": {"name": "last_name_output", "trainable": true, "units": 26, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_last_name_2", 0, 0, {}]]]}, {"name": "merge_first_last_name_1", "class_name": "Concatenate", "config": {"name": "merge_first_last_name_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["first_name_output", 0, 0, {}], ["last_name_output", 0, 0, {}]]]}, {"name": "hidden_first_last_name_1", "class_name": "Dense", "config": {"name": "hidden_first_last_name_1", "trainable": true, "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["merge_first_last_name_1", 0, 0, {}]]]}, {"name": "first_last_name_output", "class_name": "Dense", "config": {"name": "first_last_name_output", "trainable": true, "units": 26, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden_first_last_name_1", 0, 0, {}]]]}, {"name": "fl_less_model_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 26], "dtype": "float32", "sparse": false, "name": "fl_less_model_input"}, "inbound_nodes": []}, {"name": "merge_first_last_name_less", "class_name": "Concatenate", "config": {"name": "merge_first_last_name_less", "trainable": true, "axis": -1}, "inbound_nodes": [[["first_last_name_output", 0, 0, {}], ["fl_less_model_input", 0, 0, {}]]]}, {"name": "first_last_name_less_output", "class_name": "Dense", "config": {"name": "first_last_name_less_output", "trainable": true, "units": 26, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["merge_first_last_name_less", 0, 0, {}]]]}], "input_layers": [["embedding_2_input", 0, 0], ["embedding_last_name_input", 0, 0], ["fl_less_model_input", 0, 0]], "output_layers": [["first_last_name_output", 0, 0], ["first_last_name_less_output", 0, 0]]}, "keras_version": "2.0.8", "backend": "tensorflow"}